In [2]:
# import nessacary packages
import pandas as pd

In [3]:
pwd

'C:\\Users\\lizba\\Desktop\\homework\\pandas-challenge\\PyCitySchools'

In [4]:
# load student file

students = "../Resources/students_complete.csv"

# Create DataFrame

students_df = pd.read_csv(students)

# show head of DataFrame

students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
# load school file, assign variable to file name

schools = "../Resources/schools_complete.csv"

# convert into DF

school_df = pd.read_csv(schools)

# show head of DF

school_df.tail()

    School ID            school_name      type  size   budget
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [6]:
# merge schools and students data frame to create new dataframe

combined_df = pd.merge(school_df, students_df, on="school_name")
combined_df.tail(1)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
39169,14,Thomas High School,Charter,1635,1043130,39169,Carolyn Jackson,F,11th,95,75

In [7]:
# creating high level district over view

# finding unique number of schools

num_schools = combined_df["school_name"].nunique()
num_schools



# finding average of math scores
average_math_score = combined_df["math_score"].mean()
average_math_score

#finding average of math scores

average_reading = combined_df["reading_score"].mean()
average_reading

# find unique number of students

num_students = combined_df["student_name"].count()
num_students

39170

In [8]:
# finding sum of the budget

budget = combined_df["budget"].unique()
total_budget = budget.sum()

total_budget

24649428

In [9]:
#finding average of reading score

average_reading = combined_df["reading_score"].mean()
average_reading

81.87784018381414

In [10]:
# finding average of math scores

average_math_score = combined_df["math_score"].mean()
average_math_score

78.98537145774827

In [11]:
# new dataframe to aggregate passing  math scores

only_passing_math = combined_df.loc[(combined_df["math_score"]> 69)]
only_passing_math.head(3)

only_passing_math["math_score"].count()

percent_passing_math = (only_passing_math["math_score"].count()/
                        combined_df["student_name"].count())

percent_passing_math

0.749808526933878

In [12]:
# new dataframe to aggregate passing reading scores

only_passing_reading = combined_df.loc[(combined_df["reading_score"]> 69)]
only_passing_reading.head(3)

only_passing_reading["reading_score"].count()

percent_passing_reading = (only_passing_reading["reading_score"].count()/
                        combined_df["student_name"].count())

percent_passing_reading

0.8580546336482001

In [13]:
overall_passing_rate = ((percent_passing_reading) + (percent_passing_math)) / 2

overall_passing_rate

0.8039315802910391

In [14]:
# creat new district summerry table from above info

Summery_DF_District =pd.DataFrame({"Total Schools": [num_schools],
 "Total Budget": [total_budget],
  "Average Math Score": [average_math_score],
  "Average Reading Score": [average_reading],
   "% Passing Math" :[percent_passing_math],
  "% Passing Reading" :[percent_passing_reading],
  "Overall Passing Rate" :[overall_passing_rate]
 })

Summery_DF_District

,Total Schools,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,24649428,78.985371,81.87784,0.749809,0.858055,0.803932

In [17]:
# merge schools and students data frame to create new dataframe

school_stats_DF = pd.merge(school_df, DF_to_combine, on="School ID", how="left")
school_stats_DF.head()
# creating new table summerry for school aggregations

#Create an overview table that summarizes key metrics about each school, including:

,School ID,school_name,type,size,budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,0,Huang High School,District,2917,1910635,0.0,0.0,0.0,0.0,0.0,0.0
1,1,Figueroa High School,District,2949,1884411,NaN,NaN,NaN,NaN,NaN,NaN
2,2,Shelton High School,Charter,1761,1056600,NaN,NaN,NaN,NaN,NaN,NaN
3,3,Hernandez High School,District,4635,3022020,NaN,NaN,NaN,NaN,NaN,NaN
4,4,Griffin High School,Charter,1468,917500,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
school_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [19]:
#### working calc to find a few values

#grouped_schools = combined_df.\
                  # groupby(['school_name','type','budget'])\
                   #[['math_score','reading_score']].mean()

In [20]:
# performing calculation to find per student budget value

Per_stud_bud = school_df["budget"]/school_df["size"]
Per_stud_bud

0     655.0
1     639.0
2     600.0
3     652.0
4     625.0
5     578.0
6     582.0
7     628.0
8     581.0
9     609.0
10    583.0
11    637.0
12    650.0
13    644.0
14    638.0
dtype: float64

In [21]:
Per_stud_bud_series = pd.Series(Per_stud_bud)

result= pd.DataFrame(Per_stud_bud)
print(result)

        0
0   655.0
1   639.0
2   600.0
3   652.0
4   625.0
5   578.0
6   582.0
7   628.0
8   581.0
9   609.0
10  583.0
11  637.0
12  650.0
13  644.0
14  638.0

In [22]:
# creating new column in school df, budget divided by size to populate new column

per_student = school_df['budget']/school_df['size']
per_student

school_df['per_student'] = school_df['budget']/school_df['size']
school_df.head(2)

   School ID           school_name      type  size   budget  per_student
0          0     Huang High School  District  2917  1910635        655.0
1          1  Figueroa High School  District  2949  1884411        639.0

In [23]:
# performing calculation to find average match score

aver_math_score = combined_df.groupby(['school_name'])['math_score'].mean()
print(aver_math_score)


#school_df["Aver_Math"] = combined_df.groupby(['school_name'])['math_score'].mean()
#school_df.dtypes

school_df["Aver_Math"] = combined_df.groupby('school_name')[['math_score']].mean()
school_df

# produces Pandas Series
#data.groupby('month')['duration'].sum() 
# Produces Pandas DataFrame
#data.groupby('month')[['duration']].sum()


#school_df['Aver_Math'].split()

#school_df

new_math_df = combined_df.groupby('school_name')[['math_score']].mean()

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [24]:
# creating new DF with average Math score

new_math_df = combined_df.groupby('school_name')[['math_score']].mean()
new_math_df.head(2)

                     math_score
school_name
Bailey High School    77.048432
Cabrera High School   83.061895

In [25]:
# merging new df with prevoius school_df

combo_w_math = pd.merge(school_df, new_math_df, on="school_name")
combo_w_math.tail(1)

,School ID,school_name,type,size,budget,per_student,Aver_Math,math_score
14,14,Thomas High School,Charter,1635,1043130,638.0,NaN,83.418349

In [26]:
new_reading_df = combined_df.groupby('school_name')[['reading_score']].mean()
new_reading_df.head(2)

                     reading_score
school_name
Bailey High School       81.033963
Cabrera High School      83.975780

In [27]:
# merging new df with prevoius school_df

combo_w_reading = pd.merge(combo_w_math, new_reading_df, on="school_name")
combo_w_reading.head(1)

,School ID,school_name,type,size,budget,per_student,Aver_Math,math_score,reading_score
0,0,Huang High School,District,2917,1910635,655.0,NaN,76.629414,81.182722

In [28]:
# find percent passing math by finding count of students score > 69 and dividing by num_studs per school

with_passing_math = combined_df.loc[(combined_df["math_score"] > 69)] # / school_df.loc[(school_df["size"])]
with_passing_math.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84
5,0,Huang High School,District,2917,1910635,5,Bryan Miranda,M,9th,94,94
6,0,Huang High School,District,2917,1910635,6,Sheena Carter,F,11th,82,80
8,0,Huang High School,District,2917,1910635,8,Michael Roth,M,10th,95,87

In [29]:
#

M_S_counts = with_passing_math["school_name"].value_counts()
M_S_counts

Bailey High School       3318
Johnson High School      3145
Hernandez High School    3094
Rodriguez High School    2654
Wilson High School       2143
Figueroa High School     1946
Huang High School        1916
Ford High School         1871
Cabrera High School      1749
Wright High School       1680
Shelton High School      1653
Thomas High School       1525
Griffin High School      1371
Pena High School          910
Holden High School        395
Name: school_name, dtype: int64

In [30]:
school_name = school_df["school_name"]
school_name

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
Name: school_name, dtype: object

In [31]:
# pass_math_counts counts the number of students in each school that passed math. 

pass_math_count = pd.DataFrame({"pass math count": M_S_counts})
pass_math_count.head(3)


pass_math_count['school_name'] = pass_math_count.index
# df['index1'] = df.index
pass_math_count

                       pass math count            school_name
Bailey High School                3318     Bailey High School
Johnson High School               3145    Johnson High School
Hernandez High School             3094  Hernandez High School
Rodriguez High School             2654  Rodriguez High School
Wilson High School                2143     Wilson High School
Figueroa High School              1946   Figueroa High School
Huang High School                 1916      Huang High School
Ford High School                  1871       Ford High School
Cabrera High School               1749    Cabrera High School
Wright High School                1680     Wright High School
Shelton High School               1653    Shelton High School
Thomas High School                1525     Thomas High School
Griffin High School               1371    Griffin High School
Pena High School                   910       Pena High School
Holden High School                 395     Holden High School

In [32]:
updated_with_math_count = pd.merge(combo_w_reading, pass_math_count, on="school_name")
updated_with_math_count.head()


# merging new df with prevoius school_df

#combo_w_reading = pd.merge(combo_w_math, new_reading_df, on="school_name")
# ombo_w_reading.head(1)
#pass_math_df = pass_math['school_name'].count().reset_index()

,School ID,school_name,type,size,budget,per_student,Aver_Math,math_score,reading_score,pass math count
0,0,Huang High School,District,2917,1910635,655.0,NaN,76.629414,81.182722,1916
1,1,Figueroa High School,District,2949,1884411,639.0,NaN,76.711767,81.158020,1946
2,2,Shelton High School,Charter,1761,1056600,600.0,NaN,83.359455,83.725724,1653
3,3,Hernandez High School,District,4635,3022020,652.0,NaN,77.289752,80.934412,3094
4,4,Griffin High School,Charter,1468,917500,625.0,NaN,83.351499,83.816757,1371

In [33]:
# now do same steps to find num students passing reading

In [34]:
# find percent passing reading by finding count of students score > 69 and dividing by num_studs per school

with_passing_reading = combined_df.loc[(combined_df["reading_score"] > 69)] # / school_df.loc[(school_df["size"])]
with_passing_reading.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84
5,0,Huang High School,District,2917,1910635,5,Bryan Miranda,M,9th,94,94
6,0,Huang High School,District,2917,1910635,6,Sheena Carter,F,11th,82,80

In [35]:
Read_counts = with_passing_reading["school_name"].value_counts()
Read_counts

Bailey High School       4077
Johnson High School      3867
Hernandez High School    3748
Rodriguez High School    3208
Figueroa High School     2381
Huang High School        2372
Wilson High School       2204
Ford High School         2172
Cabrera High School      1803
Wright High School       1739
Shelton High School      1688
Thomas High School       1591
Griffin High School      1426
Pena High School          923
Holden High School        411
Name: school_name, dtype: int64

In [36]:
pass_reading_count = pd.DataFrame({"pass reading count": Read_counts})
pass_reading_count.head(3)


pass_reading_count['school_name'] = pass_reading_count.index
# df['index1'] = df.index
pass_reading_count

                       pass reading count            school_name
Bailey High School                   4077     Bailey High School
Johnson High School                  3867    Johnson High School
Hernandez High School                3748  Hernandez High School
Rodriguez High School                3208  Rodriguez High School
Figueroa High School                 2381   Figueroa High School
Huang High School                    2372      Huang High School
Wilson High School                   2204     Wilson High School
Ford High School                     2172       Ford High School
Cabrera High School                  1803    Cabrera High School
Wright High School                   1739     Wright High School
Shelton High School                  1688    Shelton High School
Thomas High School                   1591     Thomas High School
Griffin High School                  1426    Griffin High School
Pena High School                      923       Pena High School
Holden High School                    411     Holden High School

In [41]:
updated_with_reading_count = pd.merge(updated_with_math_count, pass_reading_count, on="school_name")
updated_with_reading_count.head()

,School ID,school_name,type,size,budget,per_student,Aver_Math,math_score,reading_score,pass math count,% passing math,pass reading count
0,0,Huang High School,District,2917,1910635,655.0,NaN,76.629414,81.182722,1916,0.656839,2372
1,1,Figueroa High School,District,2949,1884411,639.0,NaN,76.711767,81.158020,1946,0.659885,2381
2,2,Shelton High School,Charter,1761,1056600,600.0,NaN,83.359455,83.725724,1653,0.938671,1688
3,3,Hernandez High School,District,4635,3022020,652.0,NaN,77.289752,80.934412,3094,0.667530,3748
4,4,Griffin High School,Charter,1468,917500,625.0,NaN,83.351499,83.816757,1371,0.933924,1426

In [43]:
updated_with_reading_count['% passing reading'] = updated_with_reading_count['pass math count']/updated_with_reading_count["size"]

updated_with_reading_count.head(1)

,School ID,school_name,type,size,budget,per_student,Aver_Math,math_score,reading_score,pass math count,% passing math,pass reading count,% passing reading
0,0,Huang High School,District,2917,1910635,655.0,NaN,76.629414,81.182722,1916,0.656839,2372,0.656839

In [48]:
updated_with_reading_count ["Total Passing"] = (updated_with_reading_count['% passing math'] + updated_with_reading_count ['% passing reading']) / 2
updated_with_reading_count

,School ID,school_name,type,size,budget,per_student,Aver_Math,math_score,reading_score,pass math count,% passing math,pass reading count,% passing reading,Total Passing
0,0,Huang High School,District,2917,1910635,655.0,NaN,76.629414,81.182722,1916,0.656839,2372,0.656839,0.656839
1,1,Figueroa High School,District,2949,1884411,639.0,NaN,76.711767,81.158020,1946,0.659885,2381,0.659885,0.659885
2,2,Shelton High School,Charter,1761,1056600,600.0,NaN,83.359455,83.725724,1653,0.938671,1688,0.938671,0.938671
3,3,Hernandez High School,District,4635,3022020,652.0,NaN,77.289752,80.934412,3094,0.667530,3748,0.667530,0.667530
4,4,Griffin High School,Charter,1468,917500,625.0,NaN,83.351499,83.816757,1371,0.933924,1426,0.933924,0.933924
5,5,Wilson High School,Charter,2283,1319574,578.0,NaN,83.274201,83.989488,2143,0.938677,2204,0.938677,0.938677
6,6,Cabrera High School,Charter,1858,1081356,582.0,NaN,83.061895,83.975780,1749,0.941335,1803,0.941335,0.941335
7,7,Bailey High School,District,4976,3124928,628.0,NaN,77.048432,81.033963,3318,0.666801,4077,0.666801,0.666801
8,8,Holden High School,Charter,427,248087,581.0,NaN,83.803279,83.814988,395,0.925059,411,0.925059,0.925059
9,9,Pena High School,Charter,962,585858,609.0,NaN,83.839917,84.044699,910,0.945946,923,0.945946,0.945946
10,10,Wright High School,Charter,1800,1049400,583.0,NaN,83.682222,83.955000,1680,0.933333,1739,0.933333,0.933333
11,11,Rodriguez High School,District,3999,2547363,637.0,NaN,76.842711,80.744686,2654,0.663666,3208,0.663666,0.663666
12,12,Johnson High School,District,4761,3094650,650.0,NaN,77.072464,80.966394,3145,0.660576,3867,0.660576,0.660576
13,13,Ford High School,District,2739,1763916,644.0,NaN,77.102592,80.746258,1871,0.683096,2172,0.683096,0.683096
14,14,Thomas High School,Charter,1635,1043130,638.0,NaN,83.418349,83.848930,1525,0.932722,1591,0.932722,0.932722

In [51]:
# RENAME COLUMNS AND CLEAN UP DF

District_DF = updated_with_reading_count
''
District_DF.rename(columns={'school_name': 'School','type': 'Type', 'budget':'Budget','per_student': 'Budget Per Student', 'math_score': "Average Math Score",
                           
                           'reading_score': "Average Reading Score"})

,School ID,School,Type,size,Budget,Budget Per Student,Aver_Math,Average Math Score,Average Reading Score,pass math count,% passing math,pass reading count,% passing reading,Total Passing
0,0,Huang High School,District,2917,1910635,655.0,NaN,76.629414,81.182722,1916,0.656839,2372,0.656839,0.656839
1,1,Figueroa High School,District,2949,1884411,639.0,NaN,76.711767,81.158020,1946,0.659885,2381,0.659885,0.659885
2,2,Shelton High School,Charter,1761,1056600,600.0,NaN,83.359455,83.725724,1653,0.938671,1688,0.938671,0.938671
3,3,Hernandez High School,District,4635,3022020,652.0,NaN,77.289752,80.934412,3094,0.667530,3748,0.667530,0.667530
4,4,Griffin High School,Charter,1468,917500,625.0,NaN,83.351499,83.816757,1371,0.933924,1426,0.933924,0.933924
5,5,Wilson High School,Charter,2283,1319574,578.0,NaN,83.274201,83.989488,2143,0.938677,2204,0.938677,0.938677
6,6,Cabrera High School,Charter,1858,1081356,582.0,NaN,83.061895,83.975780,1749,0.941335,1803,0.941335,0.941335
7,7,Bailey High School,District,4976,3124928,628.0,NaN,77.048432,81.033963,3318,0.666801,4077,0.666801,0.666801
8,8,Holden High School,Charter,427,248087,581.0,NaN,83.803279,83.814988,395,0.925059,411,0.925059,0.925059
9,9,Pena High School,Charter,962,585858,609.0,NaN,83.839917,84.044699,910,0.945946,923,0.945946,0.945946
10,10,Wright High School,Charter,1800,1049400,583.0,NaN,83.682222,83.955000,1680,0.933333,1739,0.933333,0.933333
11,11,Rodriguez High School,District,3999,2547363,637.0,NaN,76.842711,80.744686,2654,0.663666,3208,0.663666,0.663666
12,12,Johnson High School,District,4761,3094650,650.0,NaN,77.072464,80.966394,3145,0.660576,3867,0.660576,0.660576
13,13,Ford High School,District,2739,1763916,644.0,NaN,77.102592,80.746258,1871,0.683096,2172,0.683096,0.683096
14,14,Thomas High School,Charter,1635,1043130,638.0,NaN,83.418349,83.848930,1525,0.932722,1591,0.932722,0.932722